# Add brew casks
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Install brew packages
brew "gnu-sed"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "stow"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

# http clients
brew "curl"
brew "wget"
brew "httpie"

# editors
brew "neovim"
cask "visual-studio-code"

# version control
brew "git"
brew "gh"
brew "svn" # needed for font-source-code-pro cask

# languages
brew "python"
brew "python3"
brew "rust"
brew "node"

# gpg related
brew "gnupg2"
brew "pinentry-mac"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"

# containers/virtualization
brew "kind"
brew "lima"
brew "cosign"
brew "crane"
cask "docker"
cask "vmware-fusion"

# terminal
brew "zsh"
brew "mosh"
brew "tmux"
cask "iterm2"
cask "kitty"

# others
brew "tree"
brew "htop"
brew "jq"
brew "yq"
brew "hugo"

# password/secrets
brew "pass"
brew "diceware"
cask "1password"

# communication
cask "signal"
cask "slack"
cask "zoom"

# keyboard/window management
cask "karabiner-elements"
cask "rectangle"


# reattach-to-user-namespace

# PKM
cask "obsidian"
cask "todoist"

# Install other brew GUI packages
cask "spotify"
cask "firefox-developer-edition"
# cask "vscodium" ### DOESN'T HAVE DARWIN ARM64 PACKAGE
# cask "alacritty" ### DOESN'T SUPPORT APPLE SILICON YET
cask "google-cloud-sdk"
# cask "darktable" ### DOESN'T SUPPORT APPLE SILICON YET

# fonts
cask "font-inconsolata"
cask "font-fontawesome"
cask "font-fira-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-source-code-pro" # requires svn
