ban.spellright
bungcip.better-toml
dracula-theme.theme-dracula
eamodio.gitlens
foam.foam-vscode
GitHub.codespaces
GitHub.copilot
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
jdinhlife.gruvbox
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
mushan.vscode-paste-image
rust-lang.rust
rust-lang.rust-analyzer
sainnhe.gruvbox-material
standard.vscode-standard
vscode-icons-team.vscode-icons
vsls-contrib.codetour
yzhang.markdown-all-in-one
