bungcip.better-toml
dracula-theme.theme-dracula
eamodio.gitlens
GitHub.codespaces
GitHub.vscode-pull-request-github
golang.go
hashicorp.terraform
jdinhlife.gruvbox
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
sainnhe.gruvbox-material
vscode-icons-team.vscode-icons
